Tekla.Structures.CatalogInternal.ICDelegate.InsertShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean)
DO NOT USE! For internal usage only! Insert a shape.
input: shape data for input
result: the resulting shape data from insert
AllowGeoDuplicates: set this to true if you want to allow insertion of shapes that
have a geometry that is identical to a pre-existing geometry for a shape in the catalog
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.CleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean@)
DO NOT USE! For internal usage only! Clean and modify a shape.
input: input shape info
isSolid: output value for solidity of shape, true if is solid///
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.CleanAndModifyShapeByName(System.String,System.Boolean@)
DO NOT USE! For internal usage only! Clean and modify a shape, do the selection by shape name.
name: The name, as in the Shape Catalog, of the shape to be cleaned
isSolid: output value for solidity of shape, true if it is a solid///
Returns: true (1) on success, false(0) otherwise